{
  "defaults": {
    "scrape_limit": 3,
    "time_filter": "qdr:m",
    "search_sources": ["web", "news"]
  },
  "monthly_run": {
    "scrape_top": 5,
    "segments": [
      {
        "name": "SMB Leaders",
        "description": "Founders, COOs, and Hiring Managers at growing SMBs",
        "research_focus": "Investigate the challenges Australian SMBs face with local tech talent shortages and rising salary benchmarks. Map the cost-benefit analysis of hiring remote international talent versus local hires, and identify the most common mistakes founders make when trying to manage overseas compliance and payroll for the first time. The goal is to produce actionable LinkedIn content that helps SMB leaders make smarter, cost-effective hiring decisions over the next 12 months.",
        "content_goal": "LinkedIn posts targeting SMB decision makers"
      },
      {
        "name": "Enterprise HR",
        "description": "Talent Acquisition Managers and HR Directors",
        "research_focus": "Analyze the strategic challenges for enterprise HR leaders in scaling global talent acquisition. Investigate the adoption of AI in recruitment to improve efficiency, and explore the complexities of managing a distributed workforce, including compliance, payroll, and the role of a unified HRIS. The goal is to uncover insights for strategic content aimed at senior HR professionals.",
        "content_goal": "Strategic insights for HR leadership"
      },
      {
        "name": "Australian Developers",
        "description": "Software developers and tech companies in Australia",
        "research_focus": "Identify the primary motivations, career aspirations, and key challenges for senior software developers in Australia, particularly regarding remote and international work opportunities. Research their preferences for company culture, technology stacks, and what they value most from a modern employer. The goal is to generate insights that help companies attract and retain top Australian tech talent.",
        "content_goal": "Content for Australian developer community"
      },
      {
        "name": "Outstaffer AI Recruiter",
        "description": "SMB & Mid-Market teams frustrated with slow, manual hiring, and teams seeking recruiter-quality outcomes without agency fees.",
        "research_focus": "Investigate the impact of AI in recruitment on hiring outcomes, including time-to-hire, cost savings, and candidate experience. The goal is to find data and trends that validate the Outstaffer AI Recruiter's value proposition.",
        "content_goal": "Sales enablement and marketing content"
      }
    ]
  },
  "brand_monitoring": {
    "enabled": true,
    "product_name": "Outstaffer",
    "prompt_file": "brand_monitoring.json",
    "platforms": ["reddit.com", "twitter.com", "linkedin.com"],
    "searches": [
      {
        "query": "Outstaffer EOR employer of record",
        "sources": ["web", "news"]
      },
      {
        "query": "site:reddit.com Outstaffer review experience",
        "sources": ["web"]
      }
    ]
  }
}